---
kind: type
id: T:Autodesk.Revit.DB.BackClippingParam
source: html/6ab9354f-8dbb-2f17-68d0-8de124e28125.htm
---
# Autodesk.Revit.DB.BackClippingParam

The allowed values for the VIEW_BACK_CLIPPING and VIEWER_BOUND_FAR_CLIPPING parameters.

## Syntax (C#)
```csharp
public enum BackClippingParam
```